export default function TermCon() {
  return (
    <>
      <div>เงื่อนไขการใช้สิทธิ์แลกรับเมนูเครื่องดื่มด้วย QR Code:</div>
      <div className="flex gap-2">
        <div>1.</div>
        <div>
          สิทธิ์การแลกรับเครื่องดื่ม: QR Code มีมูลค่า 100 บาท สามารถใช้
          สำหรับแลกเครื่องดื่มตามเมนูที่ร่วมรายการได้ หากเครื่องดื่มที่เลือก
          มีราคาเกิน 100 บาท *ผู้ใช้จะต้องชำระส่วนต่างเพิ่มเติม หรือ หาก
          กรณีที่เครื่องดื่มมีราคาต่ำกว่า 100 บาท ทางร้านจะไม่มีการคืน
          หรือเปลี่ยนแปลงเป็นเงินสดได้
        </div>
      </div>
      <div className="flex gap-2">
        <div>2.</div>
        <div>
          สถานที่แลกรับสิทธิ์: Mama Café ชั้น B1, โซน The Storeys (ตรงข้าม
          7-ELEVEN) *เฉพาะสาขา One Bangkok เท่านั้น
        </div>
      </div>
      <div className="flex gap-2">
        <div>3.</div>
        <div>
          ข้อจำกัด: ไม่สามารถแลกเปลี่ยนเป็นเงินสด หรือ ใช้กับเมนูอื่นๆ
          ที่ไม่ได้ร่วมรายการได้
        </div>
      </div>
      <div className="flex gap-2">
        <div>4.</div>
        <div>
          ระยะเวลาการใช้งาน QR Code: สามารถใช้ได้เพียง 1 ครั้งเท่านั้น
          และจะหมดอายุภายใน วันที่ 8 พฤศจิกายน 2567
        </div>
      </div>
      <div className="flex gap-2">
        <div>5.</div>
        <div>
          การเปลี่ยนแปลงเงื่อนไข: ขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขโดย
          ไม่ต้องแจ้งให้ทราบล่วงหน้า
        </div>
      </div>
    </>
  );
}
